Tester/src/Catalogs/Versions/Versions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Versions</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Versions/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	restoreTemplate ( CurrentObject );
	
EndProcedure

&AtServer
Procedure restoreTemplate ( Scenario )
	
	TabDoc = Scenario.Template.Get ();
	entitleTemplate ();
	markAreas ();
	
EndProcedure 

&AtServer
Procedure entitleTemplate ()
	
	caption = Output.TemplateCaption ();
	if ( 0 < ( TabDoc.TableWidth + TabDoc.TableHeight ) ) then
		caption = caption + " *";
	endif; 
	Items.PageTemplate.Title = caption;
	
EndProcedure 

&AtServer
Procedure markAreas ()
	
	noline = new Line ( SpreadsheetDocumentCellLineType.None );
	redLine = new Line ( SpreadsheetDocumentCellLineType.LargeDashed, 3 );
	redColor = new Color ( 255, 0, 0 );
	for each item in Object.Areas do
		area = TabDoc.Area ( item.Name );
		area.TopBorder = noline;
		area.LeftBorder = noline;
		area.RightBorder = noline;
		area.BottomBorder = noline;
		area.Outline ( redLine, redLine, redLine, redLine );
		area.BorderColor = redColor;
	enddo; 
			
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	ScenariosPanel.Push ( ThisObject );
	
EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageActivateError ()
		or EventName = Enum.MessageDebugger () ) then
		if ( Source = Object.Ref ) then
			activateEditor ();
			activateRow ( Parameter );
		endif; 
	endif; 
	
EndProcedure

&AtClient
Procedure activateEditor () export
	
	CurrentItem = Items.Script;
	
EndProcedure 

&AtClient
Procedure activateRow ( Line )
	
	Items.Script.SetTextSelectionBounds ( Line, 1, Line, StrLen ( StrGetLine ( Object.Script, Line ) ) + 1 );
	
EndProcedure 

&AtClient
Procedure OnClose ( Exit )
	
	ScenariosPanel.Pop ( Object.Ref );
	
EndProcedure
